In [1]:
import pandas as pd

In [2]:
data1=pd.read_excel(r'C:\Users\LENOVO\Desktop\My Data1.xlsx')

In [3]:
data1

    Name  Age  Salary
0  Pinky   30   20000
1   John   22   15000
2  Neha    25   30000
3    Raj   25   35000

In [6]:
data2=pd.read_csv(r'C:\Users\LENOVO\Desktop\My Data2.csv')

In [7]:
data2

   Roll No.     Name  Batch
0      1001    Pinky   1840
1      1002     John   1843
2      1003   Deepak   1840
3      1004  Anjuman   1765

In [8]:
data3=pd.read_csv(r'C:\Users\LENOVO\Desktop\My Data3.tsv',sep='\t')

In [9]:
data3

   RollNo.   Name  Batch
0     1001  Pinky   1840
1     1002   John   1765
2     1003   Neha   1345
3     1004    Raj   1540